{
  "meta": {
    "releasedOn": "2023.04.20"
  },

  "important": [
    {
      "note": [
      "Namespace import/export has some edge cases which prevent it from being exported.",
      "Namely, when you reference a deleted module from a page and try to export the namespace."
      ]
    }
  ],

  "added": [
    {
      "what": [
        "support for page duplication in edit mode and page builder view."
      ],
      "why": [
        "because this speeds up the development process of the project and allows users to copy/share content from one page to another."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza-webapp-compose/pull/450",
        "https://github.com/cortezaproject/corteza-locale/commit/47e06ebb251d87f3ff058e3a42dc7b26ef425ad5"
      ]
    },
    {
      "what": [
        "support for personalized auth screen."
      ],
      "why": [
        "to simplify styles of the auth pages without the need to alter the source templates.",
        "Uploading the image will update the Auth background image, and the styles will supplement Auth screen's styles."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/446"
      ]
    },
    {
      "what": [
        "support for opening a record in a new tab or in a modal."
      ],
      "why": [
        "to make editing of the records a bit more intuitive, since the user will remain on the record list page while doing the changes."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/524",
        "https://github.com/cortezaproject/corteza/pull/524"
      ]
    },
    {
      "what": [
        "support for cloning and coping page blocks in page builders."
      ],
      "why": [
        "to allow users to duplicate and re-use page blocks more easily."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/582"
      ]
    },
    {
      "what": [
        "support for viewing and undeleting a deleted single or multiple records in a record list."
      ],
      "why": [
        "to allow users to view and restore deleted records."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/740"
      ]
    },
    {
      "what": [
        "support for a fully customizable navigation page block with multiple navigation item type and customizable options for the navigation list items."
      ],
      "why": [
        "to have the ability to show one or two level of dynamic and static navigation."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/41f1283e9d393393c651b8ac5a28cae09733f1fd"
      ]
    },
    {
      "what": [
        "support for conditional fields."
      ],
      "why": [
        "to give users more control on how records are displayed."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/770"
      ]
    },
    {
      "what": [
        "support for navigating to the next or previous record when inside a record page for easier and faster toggling between the records."       
      ],
      "why": [
        "to allow users go over all their leads one by one without leaving the record page."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/836"
      ]
    },
    {
      "what": [
        "support for bulk record updates."
      ],
      "why": [
        "to allow the users to update multiple records in a record list."
      ],
      "how": [
        "by selecting the records they want to update and opening the bulk record modal by clicking on the edit button.",
        "Further on, the field that needs updating can be selected and we can give it a new value and it will be saved across all the concerned records, thus bulk updating them."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/906",
        "https://github.com/cortezaproject/corteza/pull/906",
        "https://github.com/cortezaproject/corteza/pull/906",
        "https://github.com/cortezaproject/corteza/pull/906",
        "https://github.com/cortezaproject/corteza/pull/906"
      ]
    },
    {
      "what": [
        "support for a new page block in {APP_NAME_COMPOSE} called tabs block where each tab is a different block."
      ],
      "why": [
        "to make page block organizing much easier for users."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/670",
        "https://github.com/cortezaproject/corteza/pull/670"
      ]
    },
    {
      "what": [
        "support for administrators to pre-define record list filters which can be applied to their record list if they are part of a specific role.",
        "The filters are grouped by roles, allowing more flexibility as to who sees what."
      ],
      "why": [
        "to allow users to quickly apply filter to the record list."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/921",
        "https://github.com/cortezaproject/corteza/pull/921",
        "https://github.com/cortezaproject/corteza/pull/921"
      ]
    },
    {
      "what": [
        "support for geo location capture and ability to set or prefill current location while on a map."
      ],
      "why": [
        "to improve the user experience and the location accuracy of the users.",
        "Now instead of manually entering their coordinates, they can just use the `find me` button and the coordinates will be updated."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/955",
        "https://github.com/cortezaproject/corteza/pull/955",
        "https://github.com/cortezaproject/corteza/pull/955",
        "https://github.com/cortezaproject/corteza/pull/955"
      ]
    },
    {
      "what": [
        "support for uploading an icon for specific page for the sidebar."
      ],
      "why": [
        "to allow the user to further customize a page."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/72d44713f26cd4d6cfc10a0b4a35abf00ea9394e"
      ]
    },
    {
      "what": [
        "support for geo address search functionality on the geometry module field editor/viewer."
      ],
      "why": [
        "to give users access to address search functionality when on the geometry module field editor/viewer."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/968",
        "https://github.com/cortezaproject/corteza/pull/968",
        "https://github.com/cortezaproject/corteza/pull/968",
        "https://github.com/cortezaproject/corteza/pull/968"
      ]
    },
    {
      "what": [
        "support to open record selector fields in a modal."
      ],
      "why": [
        "to make viewing of records a bit more intuitive, since the user will remain on the record list page while opening a record selector pointing to another module."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/997"
      ]
    },
    {
      "what": [
        "support to reference a record from a record selector field pointing out to another module."
      ],
      "why": [
        "to give the user an ability to view the referenced record selector on the initial record page."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/d5cb4660a7152651697804e2518a06ab047ab796"
      ]
    },
    {
      "what": [
        "support for opening a calendar event source in a modal, new tab or in the same tab according to the user configuration."
      ],
      "why": [
        "to allow the user to open the event source records without going away from the calendar block."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/1104"
      ]
    },
    {
      "what": [
        "support for radar and scatter type charts."
      ],
      "why": [
        "to give users more options when displaying data with charts."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/1148",
        "https://github.com/cortezaproject/corteza/pull/1148",
        "https://github.com/cortezaproject/corteza/pull/1148"
      ]
    },
    {
      "what": [
        "support for uploading .ico files in record lists and file page blocks."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/1072"
      ]
    },
    {
      "what": [
        "the ability for users to disable the navigation sidebar within {APP_NAME_COMPOSE} namespace public pages.",
        "The option is available under the `hide sidebar on namespace public pages` checkbox in the namespace edit screen."
      ],
      "why": [
        "because we wanted to provide the option of disabling built-in navigation in favour of re-defining it with the new navigation page block."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/41ed9ed6ba8ab474cca7a512f04601ebf0ee4ecd"
      ]
    },
    {
      "what": [
        "auto-refreshing and manual refreshing feature to page blocks excluding, Content, Record and File Blocks.",
        "An icon now appears on blocks when you enable the refresh feature.",
        "That icon is clickable even though refresh will happen automatically based on the duration you have set."
      ],
      "why": [
        "because users do not have to refresh the entire page to see new content on blocks and to give users more control over refreshing when auto-refreshing is not needed."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza-js/pull/73",
        "https://github.com/cortezaproject/corteza/pull/760"
      ]
    },
    {
      "what": [
        "geometry page block to render a map with data points collected from record sources.",
        "The geometry page block can show either points, lines or polygons based on the configured record feed sources."
      ],
      "why": [
        "to enable the users with better visual representation of their data."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/538" 
      ]
    },
    {
      "what": [
        "new style configuration for the file page block and file record field.",
        "Users can now change the height, width, borders, margins and the background color of their file attachment."
      ],
      "why": [
        "to provide users with more customization and styling option on viewing images."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/533"
      ]
    },
    {
      "what": [
        "an option to magnify certain page blocks when viewing a public {APP_NAME_COMPOSE} page.",
        "A select dropdown has been added in the general tab of page block configuration modal for calendar, chart, content, comments, file, iframe, record list, report, and record revisions page blocks.",
        "The user can select between Fullwidth or Modal select option, and when enabled, the user will see a magnify icon at the top of the block."
      ],
      "why": [
        "to help users finding the info they are looking for much faster and easier with the option to magnify certain page blocks."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/576"
      ]
    },
    {
      "what": [
        "a spinner to indicate when an action in template editor is submitted."
      ],
      "why": [
        "to have an UI consistency, because it was difficult to tell when your changes were being submitted."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/708"
      ]
    },
    {
      "what": [
        "a module field description when configuring a record list page block to inform the users that if no fields are selected, the default values will be shown."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/751"
      ]
    },
    {
      "what": [
        "ability to serve data as response in an integration gateway route by adding a route description field."
      ],
      "why": [
        "to give an endpoint response greater extensibility to integration gateway as different data can be returned."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/775",
        "https://github.com/cortezaproject/corteza/pull/775",
        "https://github.com/cortezaproject/corteza/pull/775",
        "https://github.com/cortezaproject/corteza/pull/775",
        "https://github.com/cortezaproject/corteza/pull/775"
      ]
    },
    {
      "what": [
        "Route description field, Filters sorting, Profiler hits purging and Integration gateway settings."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/775",
        "https://github.com/cortezaproject/corteza/pull/775"
      ]
    },
    {
      "what": [
        "`BETWEEN` and `NOT BETWEEN` operator support for single value fields (number and date-time module fields)."
      ],
      "why": [
        "to extend record filtering support for range filtering of numeric and date-time for single value field."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/813"
      ]
    },
    {
      "what": [
        "ability to drill down charts, by clicking on a data entry inside the chart.",
        "Based on the configuration it can either filter an existing record list on the page that is showing the records from the same module as the chart or open a new record list in a modal."
      ],
      "why": [
        "to make it easier for users to filter record lists based on chart data, in order to view the details of said data."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/877"
      ]
    },
    {
      "what": [
        "functionality to generate user avatars and enable users to upload and manage their profile photos."
      ],
      "why": [
        "to provide users with greater flexibility and customization options for their profile avatars, while also allowing admins to manage avatars on behalf of users."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/887"
      ]
    },
    {
      "what": [
        "drag-and-drop expression sorting in workflows expression step."
      ],
      "why": [
        "to allow the user the ability to sort the existing expressions for a more intuitive and faster workflow implementation."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/1081"
      ]
    },
    {
      "what": [
        "`Auto` grouping and timeline to radar and scatter type charts."
      ],
      "why": [
        "to give users more options when displaying data with charts."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/1148"
      ]
    },
    {
      "what": [
        "extended record duplicate detection configuration to support multi value matching criteria and value checking algorithms."
      ],
      "why": [
        "to extend support for record duplicate detection with multiple fields in single rule with various detection algorithm and muli-value matching criteria."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/617",
        "https://github.com/cortezaproject/corteza/pull/617"
      ]
    },
    {
      "what": [
        "new file configurator option to preview image in modal and option to download.",
        "Images on the file base are centered now by default."
      ],
      "why": [
        "to center the images on the filebase for better user experience."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/937",
        "https://github.com/cortezaproject/corteza/pull/937"
      ]
    }
  ],

  "changed": [
    {
      "what": [
        "the requirement to provide a handle when creating a resource is now optional.",
        "The change is applied in {APP_NAME_COMPOSE}, {APP_NAME_ADMIN}, {APP_NAME_REPORTER}, and {APP_NAME_WORKFLOW}"
      ],
      "why": [
        "because providing a handle shouldn't be a necessity.",
        "The resource can be created without it."
      ],
      "how": [
        "by removing the requirement for the handle to be provided."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza-webapp-compose/commit/cd86e854b76866eeb67d33753b1b736be0d1957a", 
        "https://github.com/cortezaproject/corteza-webapp-reporter/commit/cf21c47c17c1b76eefc461543236abdf04277cb0", 
        "https://github.com/cortezaproject/corteza-webapp-admin/commit/456c896adaa7e3423c81d05a541f044b5acc9cc8", 
        "https://github.com/cortezaproject/corteza-webapp-workflow/commit/9b88af07260977ea744cce8ff7f54185ad9bd5d3", 
        "https://github.com/cortezaproject/corteza-locale/commit/24b0dda5d434b8f8f0df55d98d6695171533d81c", 
        "https://github.com/cortezaproject/corteza-vue/commit/34f261acc5297654eb372b8e804a7fd37e7b0d0e", 
        "https://github.com/cortezaproject/corteza-js/commit/3a90a1002074e31017b2ae22e5d74404283ea3e2" 
      ]
    },
    {
      "what": [
        "the record revision table text to be saying `No record revisions found` when no revisions are present."
      ],
      "why": [
        "to have a better user experience when there are no record revisions present."
      ],
      "how": [
        "by adding an empty table with `No record revisions found` message in the record page builder."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/758"
      ]
    },
    {
      "what": [
        "the Record ID field in module connection settings being able to be disabled."        
      ],
      "why": [
        "to prevent users from disabling Record ID field on system field mapping and to not show system fields that are not available.",
        "Also to allow users to easily enable or disable system fields based on their configuration."
      ],
      "how": [
        "by updating system view configurator and system field mapping logic to prevent Record ID from being disabled."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/523" 
      ]
    },
    {
      "what": [
        "the name of a page when was copied multiply times was changed to show the copy and after that the name of the page and a counter in brackets."
      ],
      "why": [
        "to improve user experience.",
        "If we copy a page 3-4 or more times, the naming gets confusing and too long."
      ],
      "how": [
        "by filtering how many times a certain page with same name already exists and including 'copy of' prefix and number suffix.",
        "Depending on the number of pages that match the same name, a counter is adjusted."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/644" 
      ]
    },
    {
      "what": [
        "workflow iterators to treat limit 0 parameter as no limit set."
      ],
      "why": [
        "to make workflow iterators consistent with other searching/filtering interactions."
      ],
      "how": [
        "by changing the limit in the code."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/cc24e622a" 
      ]
    },
    {
      "what": [
        "the geometry multivalue map opening the default map location regardless which record location you press.",
        "Now the opened map changes according to the record's geo location."
      ],
      "why": [
        "to prevent a confusion when different markers in multivalue fields were being opened on the map.",
        "This change aims to improve ux and usability of the geometry field."
      ],
      "how": [
        "Leaflet map instance and zoom level was updated."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/940"
      ]
    },
    {
      "what": [
        "the rotate and metric label field configuration for pie and doughnut charts by hiding the configuration since it was not needed."
      ],
      "why": [
        "to have consistency since they were shown but not needed.",
        "Now they are hidden since we don't need them."
      ],
      "how": [
        "updating the chart configurations to adjust existing rotate logic for the above-mentioned charts."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/992"
      ]
    },
    {
      "what": [
        "the output format to become hidden if output relative value is selected in date field."
      ],
      "why": [
        "to prevent confusion since when you have relative value, the output format is not taken into account."
      ],
      "how": [
        "by updating the date and time configuration."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/1019"
      ]
    },
    {
      "what": [
        "the record toolbar back button to always bring you back to the page where you came from."
      ],
      "why": [
        "to prevent users getting stuck in a loop and to allow them to go back to the previous page that they were onto."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/1155"
      ]
    },
    {
      "what": [
        "general ui/ux improvements:",
        "* A configuration option on charts to disable or enable animation in order to allow users more control over chart configuration options.",
        "* The warning message for unsaved changes before navigating to another page in order to prevent losing unsaved changes by unintentionally navigating to another page.",
        "* Support for inline editing in record lists in order to allow user to easily edit a record by just hovering on the field and pressing on the edit button.",
        "* Option to allow duplicate values for single and multi value user, record and select fields, so that users can have more control over their selections and whether they will be allowing duplicate values or not.",
        "* Support for managing namespace button on compose sidebar in order to allow the users the ability to go in namespace settings directly from the compose sidebar.",
        "* The color of the button for confirming the action to accept a privacy request in order to match the same color pattern as the colors when confirming/denying the action to reject a privacy request.",
        "* Long page titles being cut off.",
        "* The location of the attachment modal in order to enable previewing of attachments in private pages.",
        "* The overlapping between zoom button on the geometry page block with the page block edit group buttons so that the page block edit group button is clickable on geometry page blocks.",
        "* Uninformative internal error error message on the user profile change password interface so that users can understand better of what and why the error was caused.",
        "* The usage of chart.js on admin dashboard with e-charts so that all places where we used to use chart.js since we transitioned to apache e-charts can be removed.",
        "* The description of handle/namespace slug so that we can have consistency across our system and to be more user friendly.",
        "* The `NaN items` with `0 items` when no resources are present so that we can have consistency, since on every other place when there are no items, we display them as zero."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/806",
        "https://github.com/cortezaproject/corteza/pull/780",
        "https://github.com/cortezaproject/corteza/pull/956",
        "https://github.com/cortezaproject/corteza/pull/1136",
        "https://github.com/cortezaproject/corteza/pull/1129",
        "https://github.com/cortezaproject/corteza/commit/8379518",
        "https://github.com/cortezaproject/corteza/pull/1069",
        "https://github.com/cortezaproject/corteza/commit/6ade04484397285d541a2da1ff88e497c98717fb",
        "https://github.com/cortezaproject/corteza/pull/821",
        "https://github.com/cortezaproject/corteza/commit/73a29b6b9",
        "https://github.com/cortezaproject/corteza/commit/390a14ea73b7e0836fccd735a648baa3c42b730d",
        "https://github.com/cortezaproject/corteza/pull/993",
        "https://github.com/cortezaproject/corteza/pull/999"
      ]
    }
  ],

  "fixed": [
    {
      "what": [
        "discovery not displaying any search result when namespace with module filters was selected."
      ],
      "how": [
        "by adding minimum string match criteria to match exact string match for search results."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/e2c374c106f13455811fce83bde2ed654e8e964a"
      ]
    },
    {
      "what": [
        "{APP_NAME_COMPOSE} Gauge chart not displaying the correct results when post processing function was used because the post processing function was not taken into consideration."
      ],
      "how": [
        "by adding a post processing method to Gauge Chart {APP_NAME_COMPOSE} type."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/865"
      ]
    },
    {
      "what": [
        "the integration gateway route search filtering in administration area not returning any result if the whole name was not entered."
      ],
      "how": [
        "by fixing the way filtering works on integration routes search."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza-server/commit/e551b735be59229bfdadba11ab7ae7ab525f84af"
      ]
    },
    {
      "what": [
        "the deleted status on application programming interface gateway route update getting preserved.",
        "Previously if you edited a deleted route, the route got restored, now this is improved."
      ],
      "how": [
        "by changing the part of application programming interface gateway service that handles route updates."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/16257e9d4b49dea0038a9ddb4372b5f3ec949915"
      ]
    }
  ]
}
