{
  "meta": {
    "releasedOn": "2023.02.10"
  },
  "added": [
    {
      "what": [
        "support for casting numbers to float inside workflow expressions via the float function."
      ],
      "why": [
        "to simplify type casting by using a function instead of an intermediate workflow expression variable."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/38b6cb35e703377cce14b507be601e176face8a2"
      ]
    },
    {
      "what": [
        "ability to toggle block border."
      ],
      "why": [
        "to make better distinction between blocks when they are not shown as a cards."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/860/commits/6308bdfebb0b22cc5073de817cf7ba233690f213"
      ]
    }
  ],
  "changed": [
    {
      "what": [
        "making name property required when creating templates, dal connections, workflows, auth clients and sensitivity levels."
      ],
      "why": [
        "because we were able to create a resource without any data entered, and with this change now we have a requirement and you cannot create a resource without data entered."
      ],
      "how": [
        "by adding validations to prevent creating one of the listed resources without adding a name."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/38a02d5b95e0467e129a8c48992fa3e4f373300a"
      ]
    },
    {
      "what": [
        "the usage of chart.js on admin dashboard with e-charts."
      ],
      "why": [
        "to remove all places where we used to use chart.js since we transitioned to apache e-charts."
      ],
      "how": [
        "The chart is now in line with other charts in {PRODUCT_NAME}, the date tooltips are now also correctly displayed."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/7daafa11e1e72aa5e75ba0a8505a58f09ab02b73"
      ]
    },
    {
      "what": [
        "the record organizer now gets filtered based on the key field and key value."
      ],
      "why": [
        "to avoid putting the knowledge on how to set up the pre-filter and make the record organizer work on the user."
      ],
      "how": [
        "by generating a filter based on the key field and value and `AND-ing` it with the pre-filter."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/23984995ae0dccc82c12a930e46e6c9353eb9366"
      ]
    }
  ],
  "fixed": [
    {
      "what": [
        "record organizer did not properly load when used on record pages while using ${recordID} in pre-filter.",
        "If used on a record page, the values also now get properly prefilled."
      ],
      "how": [
        "by properly fetching once the record object becomes available and providing the reference record so values can be prefilled."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/23984995ae0dccc82c12a930e46e6c9353eb9366"
      ]
    },
    {
      "what": [
        "{PRODUCT_NAME}ID datatype in PostgreSQL database."
      ],
      "how": [
        "by changing the datatype for {PRODUCT_NAME}ID in the PostgreSQL database from bigint to numeric."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/830/commits/3a0df06ac9935dda0885b702d645563ef4df6f67"
      ]
    },
    {
      "what": [
        "authenticated role being overwritten on server restart if the role was being modified."
      ],
      "how": [
        "by adding a check in the provision logic to skip base roles & RBAC rules if they were already provisioned."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/88204f7725d452b83ca6073425c8708b7f929710"
      ]
    },
    {
      "what": [
        "integration gateway filter table was not properly refreshed in rare cases."
      ],
      "how": [
        "by adding a spinner to the integration gateway filter table, so that it is properly refreshed when fetched."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/cfe7e5072091c144e2fab7a0bd8092e5dc8f262d"
      ]
    },
    {
      "what": [
        "saving issue with module discovery settings.",
        "If you had any configuration set for discovery in a module, the module was not saving properly."
      ],
      "how": [
        "by migrating discovery settings to support multi-language, and updated module discovery config struct to support multi lang result."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/commit/724804c493703a2dca897fa9bcc5227d69a117dd",
        "https://github.com/cortezaproject/corteza/commit/e020f7453a6b9c20fdd2c2c1c370ad3de2e857d2"
      ]
    },
    {
      "what": [
        "record list filter builder for date only and time only filter types which was not working as expected."
      ],
      "how": [
        "by updating the record list filter builder with the correct query entry for time only and date only."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/847/commits/727a7e5115cd4b97d725b469f7d34b43b633892f"
      ]
    },
    {
      "what": [
        "the record revision date-time type not showing correctly."
      ],
      "how": [
        "by updating the type section translation on the record revision configurator to display the fields as camel case, which is the case for the date-time on the translation itself."
      ],
      "refs": [
        "https://github.com/cortezaproject/corteza/pull/863/commits/04f10a5fb167f9eed6c2b68fefffe1c05b0ccfcd"
      ]
    }
  ]
}